#+Title: Talks
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+OPTIONS: num:nil reveal_mathjax:t toc:nil
#+REVEAL_THEME: night
#+REVEAL_TRANS: linear

*** Código con org-babel
#+BEGIN_SRC ruby :export both
  def prime(p)
    return (2..Math.sqrt(p)).none? { |d| p % d == 0 }
  end

  [prime(42),prime(97),prime(5),prime(7),prime(9)]
#+END_SRC

#+RESULTS:
| false | true | true | true | false |

| false | true | true | 
  
